# pandas
used for basically data analysis such as data manipulation, data visualisation, building ML models
Panas Data Structures are..........Series(works as numpy array), Data Frame
Pandas is basically build on top of numpy array

# Pandas Series

In [ ]:
import pandas as pd

In [ ]:
#series() function works just like the np.array()
a = pd.Series([1,2,3,4,5])

In [ ]:
a

Here the 1st column represents as index & the 2nd column represents the value

In [ ]:
#If we want to check the type of "a"
type(a)

In [ ]:
a[2]

In [ ]:
a = pd.Series(['a','b','c'])

In [ ]:
a

N.B: In Series() function if we store there string then it represent as 'OBJECT'

In [ ]:
#If we want the date list 
a = pd.date_range(start = '01-01-2020', end = '07-05-2020')

In [ ]:
a

In [ ]:
type(a)

# Pandas DataFrame

In [ ]:
import numpy as np

In [ ]:
temp = np.random.randint(low = 20, high = 100, size = [20,]) #That means 20 to 100 random values of 20 size
name = np.random.choice(['Faysal', 'Borshon', 'Nadia', 'Nodi'], 20) #That means these names are coming randomly 20 times
value = np.random.choice(['75','77','2','100'], 20)

Now we will zip all the variables to a list for making the DataFrame properly

In [ ]:
#Data Frame with list
a = list(zip(temp, name, value))

In [ ]:
df = pd.DataFrame(data = a, columns = ['Temp', 'Name', 'Value'])

In [ ]:
df

In [ ]:
type(df)

In [21]:
#Data Frame with dictionary
df = pd.DataFrame({'temp':temp, 'Name':name, 'value':value})

In [22]:
df

    temp     Name value
0     42  Borshon   100
1     48    Nadia     2
2     91    Nadia    77
3     61    Nadia    77
4     56     Nodi    75
5     39    Nadia    75
6     79    Nadia   100
7     95   Faysal    77
8     58  Borshon    77
9     90     Nodi    75
10    68   Faysal   100
11    48    Nadia   100
12    59     Nodi    75
13    99     Nodi     2
14    75  Borshon   100
15    80  Borshon   100
16    72    Nadia    77
17    65  Borshon   100
18    73   Faysal    75
19    46     Nodi    75

In [23]:
#for initial 5 values
df.head()

   temp     Name value
0    42  Borshon   100
1    48    Nadia     2
2    91    Nadia    77
3    61    Nadia    77
4    56     Nodi    75

In [25]:
#For last 5 values
df.tail()

    temp     Name value
15    80  Borshon   100
16    72    Nadia    77
17    65  Borshon   100
18    73   Faysal    75
19    46     Nodi    75

In [26]:
#Dimension of Data Frame
df.shape

(20, 3)

In [27]:
df.columns

Index(['temp', 'Name', 'value'], dtype='object')

In [30]:
df.Name

0     Borshon
1       Nadia
2       Nadia
3       Nadia
4        Nodi
5       Nadia
6       Nadia
7      Faysal
8     Borshon
9        Nodi
10     Faysal
11      Nadia
12       Nodi
13       Nodi
14    Borshon
15    Borshon
16      Nadia
17    Borshon
18     Faysal
19       Nodi
Name: Name, dtype: object

In [31]:
#Another way to show column and most used way
df['Name']

0     Borshon
1       Nadia
2       Nadia
3       Nadia
4        Nodi
5       Nadia
6       Nadia
7      Faysal
8     Borshon
9        Nodi
10     Faysal
11      Nadia
12       Nodi
13       Nodi
14    Borshon
15    Borshon
16      Nadia
17    Borshon
18     Faysal
19       Nodi
Name: Name, dtype: object

In [34]:
#This will return all the statistics of temp column
df['temp'].describe()

count    20.000000
mean     67.200000
std      18.106701
min      39.000000
25%      54.000000
50%      66.500000
75%      79.250000
max      99.000000
Name: temp, dtype: float64

In [35]:
#To know all the information of Data Frame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   temp    20 non-null     int32
 1   Name    20 non-null     object
 2   value   20 non-null     object
dtypes: int32(1), object(2)
memory usage: 528.0+ bytes